#include "systick.h"
/*****************************************************************************************
*函数功能：系统滴答定时器nms延时
*函数形参:无
*函数返回值：无
*函数备注:
*
*****************************************************************************************/

void SysTick_delay_ms(u16 ms)
{
	SysTick->CTRL &=~(1<<2);//选择21M内部时钟
	SysTick->VAL = 0;//清零计数器
	SysTick->LOAD = ms*21000;//设置重载值
	SysTick->CTRL |=1<<0;//使能定时器
	while( !(SysTick->CTRL & (1<<16)) );//等待计数完成
	SysTick->CTRL &=~(1<<16);//清零
	SysTick->CTRL &=~(1<<0);//关闭定时器
}


/*****************************************************************************************
*函数功能：系统滴答定时器nus延时
*函数形参:无
*函数返回值：无
*函数备注:
*
*****************************************************************************************/

void SysTick_delay_us(u16 us)
{
	SysTick->CTRL &=~(1<<2);//选择21M内部时钟
	SysTick->VAL = 0;//清零计数器
	SysTick->LOAD = us*21;//设置重载值
	SysTick->CTRL |=1<<0;//使能定时器
	while( !(SysTick->CTRL & (1<<16)) );//等待计数完成
	SysTick->CTRL &=~(1<<16);//清零
	SysTick->CTRL &=~(1<<0);//关闭定时器
}
